--[[
<< تم برمجه وكتابه السورس من قبل مطورين >>
<<         @RRR_RP  \  @TH3LEDR          >>
]]
function run(msg, matches)
if msg.to.type == 'channel' and redis:get(boss..'group:add'..msg.to.id) then
if matches[1] == "الاوامر" then
if not is_mod(msg) then return "🔅¦هاذه الامر يخص [الادمن,المدير,المنشى]" end
return [[
❂┇الآوآمـر آلعآمـهہ‌‏ للمجموعهہ‌‏     ⇓⇓⇓  


👨‍🔧┇م1 ❯❯ لعرض آوآمر آلحمآيهہ‌‏

👨‍💻┇م2 ❯❯ لعرض آوآمر آلآدارهہ‌‏

👨‍🎨┇م3 ❯❯ لعرض آوآمر آعدادات

🕵️‍♂️┇م4 ❯❯ لعرض آوآمر آلعامهہ‌‏

👨‍🔧┇م المطور ❯❯ آوآمر المطور

🎭┇قناة السورس ~» @lJOKERI
]]
end
if matches[1]== 'م1' then
if not is_mod(msg) then return "🔅¦هاذه الامر يخص [الادمن,المدير,المنشى]" end
local text =[[
👨‍🔧 ❯❯ آوآمر حماية آلمجموعهہ‌‏
📌┇ـ➖➖➖➖➖➖➖
🔐┇ آوآمر لقفل وفتح الحمايهہ‌‏ 
📌┇ـ➖➖➖➖➖➖➖
📮┇ قفل ~ فتح  : الروابط
📮┇ قفل ~ فتح  : التاك
📮┇ قفل ~ فتح  : المعرفات
📮┇ قفل ~ فتح  : التعديل
📮┇ قفل ~ فتح  : المتحركه
📮┇ قفل ~ فتح  : الصور
📮┇ قفل ~ فتح  : الملفات 
📮┇ قفل ~ فتح  : الملصقات
📮┇ قفل ~ فتح  : الفيديو
📮┇ قفل ~ فتح  : الانلاين
📮┇ قفل ~ فتح  : الدردشه
📮┇ قفل ~ فتح  : التوجيه
📮┇ قفل ~ فتح  : الفيديو
📮┇ قفل ~ فتح  : البصمات
📮┇ قفل ~ فتح  : الاشعارات
📮┇ قفل ~ فتح  : الجهات
📮┇ قفل ~ فتح  : الصوت
📮┇ قفل ~ فتح  : الانلاين
📮┇ قفل ~ فتح  : التكرار 
📮┇ قفل ~ فتح  : الكلايش
📮┇ قفل ~ فتح  : البوتات
📮┇ قفل ~ فتح  : البوتات بالطرد
📮┇ قفل ~ فتح  : الـكـل
➖➖➖➖➖➖➖
🎭┇قناة السورس ~» @lJOKERI
]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م2' then
if not is_mod(msg) then return "🔅¦هاذه الامر يخص [الادمن,المدير,المنشى]" end
local text = [[
👨🏻‍💻 ❯❯ آوآمر آلآدارهہ‌‏ 
📌┇ـ➖➖➖➖➖➖➖
📮┇[ آوآمر الحظر بالرد او بمعرف]
📌┇ـ➖➖➖➖➖➖➖
💢┇طرد بالرد او بالمعرف 
💢┇حظر / الغاء الحظر 
💢┇كتم / الغاء الكتم 
💢┇تقييد / الغاء التقييد
💢┇منع  / الغاء المنع 

🚸┇[ آوآمر الرفع والتنزيل ]  
📌┇ـ➖➖➖➖➖➖➖
💢┇[ ارفع ~ انزل ] : عضو مميز
💢┇[ ارفع ~ انزل ] : اداري
💢┇[ ارفع ~ انزل ] : مدير 
💢┇[ ارفع ~ انزل ] : منشى
📌┇ـ➖➖➖➖➖➖➖
👋🏻┇[ تفعيل ~ تعطيل ] : الترحيب 
👨‍🔧┇[ تفعيل ~ تعطيل ] : الردود
💳┇[ تفعيل ~ تعطيل ] : الايدي
➖➖➖➖➖➖➖
🎭┇قناة السورس» @lJOKERI
]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م3' then
if not is_mod(msg) then return "🔅¦هاذه الامر يخص [الادمن,المدير,المنشى]" end
local text = [[
👨‍💻┇ ❯❯  آوآمر آعدادات
📌┇ـ➖➖➖➖➖➖➖
⚙┇وضع + الاوامر الادناه
📌┇ـ➖➖➖➖➖➖➖
💢 ¦  ضع الترحيب 
💢 ¦  ضع قوانين 
💢 ¦  ضع وصف 
💢 ¦  ضـع رابط 
💢 ¦  الـرابـط 
📌┇ـ➖➖➖➖➖➖➖
⚙┇ آوآمر لرؤية الاعدادات 
📌┇ـ➖➖➖➖➖➖➖
💢 ¦  القوانين 
💢 ¦  الادمنيه 
💢 ¦  المدراء 
💢 ¦  المكتومين 
💢 ¦  المطور 
💢 ¦  معلوماتي
💢 ¦  الحمايه 
💢 ¦  الوسائط 
💢 ¦  الاعدادات 
💢 ¦  المجموعه 
💢 ¦  جهاتي
➖➖➖➖➖➖➖
🎭┇قناة السورس ~» @lJOKERI
]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م4' then
if not is_mod(msg) then return "🔅¦هاذه الامر يخص [الادمن,المدير,المنشى]" end
local text = [[
🕵️‍♂️┇ آوآمر آلعامهہ‌‏

📌¦ـ➖➖➖➖➖
👨‍💻 معلوماتك الشخصيه 😻
🗃¦ اسمي : لعرض اسمك ♦️
🗃¦ معرفي : لعرض معرفك 🔹
🗃¦ ايديي : لعرض ايديك 🔸
📌¦ـ➖➖➖➖➖
👨‍💻¦ اوامر التحشيش 🤓
🗃¦ تحب + (اسم الشخص)
🗃¦ بوس + (اسم الشخص) 
🗃¦ كول + (اسم الشخص) 
🗃¦ كله + الرد + (الكلام) 
📌¦ـ➖➖➖➖➖
🎭┇قناة السورس ~» @lJOKERI
]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== "م المطور" then
if not is_mod(msg) then return "🔅¦هاذه الامر يخص [المطور فقط]" end
local text = [[
👨‍🔧┇ آوآمر المطور

📌¦ـ➖➖➖➖➖
💢¦ تحديث
💢¦ مسح الادمنيه 
💢¦ مسح المميزين 
💢¦ مسح المدراء 
💢¦ مسح المطورين   
💢¦ تفعيل : لتفعيل البوت 
💢¦ تعطيل : لتعطيل البوت 
💢¦ اسم بوتك + غادر : لطرد البوت

💢¦ اذاعه 
💢¦ اذاعه خاص 
💢¦ اذاعه عام 
💢¦ اذاعه عام بالتوجيه

♻️¦ تحديث السورس 
📌¦ـ➖➖➖➖➖

🎭┇قناة السورس ~» @lJOKERI
]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'اوامر الرد' then
if not is_owner(msg) then return "🔅¦ للمدراء فقط 🎖" end
local text = [[
🗯¦ جميع اوامر الردود 
🔅¦ـ➖➖➖➖➖
🔅¦ الردود : لعرض الردود المثبته
🔅¦ اضف رد : لأضافه رد جديد
🔅¦ مسح رد  الرد المراد مسحه
🔅¦ مسح الردود : لمسح كل الردود
🔅¦ اضف رد عام : لاضافه رد لكل المجموعات
🔅¦ مسح رد عام : لمسح الرد العام 
🔅¦ مسح الردود العامه : لمسح كل ردود العامه
🔅¦ـ➖➖➖➖➖
🎭┇قناة السورس ~» @lJOKERI
]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== "اوامر الملفات" then
if not is_mod(msg) then return "🔅¦هاذه الامر يخص [المطور الاساسي]" end
local text = [[☔️¦ اوامر الملفات 🌑

🔅¦ /p  لعرض قائمه الملفات السو`رس 
🔅¦ /p + اسم الملف المراد تفعيله 
🔅¦ /p - اسم الملف المراد تعطيله 
🔅¦ sp + ا`لاسم | لارسال الملف اليك 
🔅¦ dp + اسم الملف المراد حذفه 
🔅¦ sp all | لارسالك كل ملفات السورس 

]]
return sendMsg(msg.to.id,1,text,'md')
end end 
if matches[1] == "سورس" or matches[1]=="السورس" then
return [[
🛠 ┇تنصـيب سـورس آلجوكر 🃏  

————༻🃏༺————

⚀» لتنصيب السورس بكود واحد 
⚂» اضغط على👇الكود ليتم نسخه 
⚁» الصق الكود في الترمنال ثم انتر

┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
`git clone https://github.com/TAEMJOKER/TH3JOKER.git;cd TH3JOKER;chmod +x ins;./ins`
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉

⚀» بنهاية التنصيب رح يطلب منك  
⚁»التوكن تخلي التوكن ادوس انتر 
⚂» معرفك ادوس انتر بعد ماتخلي 
⚃» التوكن والمعرف اكتمل التنصيب
⚄» كود الرن  👇
`./TH3JOKER/run`

————༻🃏༺————

🎭┇قناة السورس» @lJOKERI
 ]]
end end
return{patterns = {"^(السورس)$","^(سورس)$","^(م المطور)$", "^(اوامر الرد)$", "^(اوامر الملفات)$", "^(الاوامر)$", "^(م1)$", "^(م2)$", "^(م3)$", "^(م4)$", }, run = run,}